constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;
rho            [1 -3 0 0 0 0 0] 1;        // density [kg/m^3]
mu             [1 -1 -1 0 0 0 0] 1.0e-2;  // dynamic viscosity [Pa*s]
nu             [0 2 -1 0 0 0 0] 1.0e-2;    // kinematic viscosity (mu/rho)
// ************************************************************************* //
